Repository: zitherharpnomna/locale
Catalog: assets/nomna_*.arb
Languages: vi, zh_hans

# l0
source: Translate
vi: Phiên dịch
zh_hans: 翻译

# l1
source: Camera
vi: Máy ảnh
zh_hans: 相机

# l2
source: Gallery
vi: Thư viện
zh_hans: 图片

# l3
source: Enter text...
vi: Nhập văn bản...
zh_hans: 输入文字···

# l4
source: Paste
vi: Dán
zh_hans: 粘贴

# l5
source: History
vi: Lịch sử
zh_hans: 历史

# l6
source: Settings
vi: Cài đặt
zh_hans: 设置

# l7
source: Saved
vi: Đã lưu
zh_hans: 已保存

# l8
source: Empty
vi: Trống
zh_hans: 空空如也

# l9
source: Language
vi: Ngôn ngữ
zh_hans: 语言

# l00
source: Fonts
vi: Phông chữ
zh_hans: 字体

# l01
source: Preview
vi: Xem trước
zh_hans: 预览

# l02
source: Search
vi: Tìm kiếm
zh_hans: 搜索

# l03
source: Reset
vi: Đặt lại
zh_hans: 重置

# l04
source: Download
vi: Tải xuống
zh_hans: 下载

# l05
source: Name
vi: Tên
zh_hans: 名字

# l06
source: Size
vi: Kích thước
zh_hans: 大小

# l07
source: Newest
vi: Mới nhất
zh_hans: 最新

# l08
source: Trending
vi: Thịnh hành
zh_hans: 流行

# l09
source: More translations
vi: Các bản dịch khác
zh_hans: 其他翻译

# l10
source: Theme
vi: Chủ đề
zh_hans: 主题

# l11
source: {theme, select, system{Automatic} light{Light} dark{Dark} other{}}
vi: {theme, select, system{Tự động} light{Sáng} dark{Tối} other{}}
zh_hans: {theme, select, system{自动} light{亮} dark{暗} other{}}

# l12
source: {status, select, listening{Speak now...} notListening{Has been completed} other{}}
vi: {status, select, listening{Đang nghe...} notListening{Đã kết thúc phiên} other{}}
zh_hans: {status, select, listening{正在聆听···} notListening{停止聆听} other{}}

# l13
source: Tap the mic button to start
vi: Nhấn vào micro để bắt đầu
zh_hans: 请点击麦克风听写

# l14
source: The source text was copied
vi: Đã sao chép văn bản gốc
zh_hans: 已复制原文

# l15
source: The target text was copied
vi: Bản dịch đã được sao chép
zh_hans: 翻译已复制

# l16
source: Clear all
vi: Xóa tất cả
zh_hans: 清除所有

# l17
source: Confirm
vi: Xác nhận
zh_hans: 确认

# l18
source: Back
vi: Quay lại
zh_hans: 取消

# l19
source: Model
vi: Mô hình
zh_hans: 模型

# l20
source: Are you sure to clear all histories?
vi: Xác nhận xóa tất cả phiên lịch sử?
zh_hans: 你确定清除所有历史记录？

# l21
source: Quick translate
vi: Dịch nhanh
zh_hans: 快译

# l22
source: App version: {version}
vi: Phiên bản ứng dụng: {version}
zh_hans: 软件版本：{version}

# l23
source: Rate this translation
vi: Đánh giá bản dịch
zh_hans: 请对此翻译评分

# l24
source: Your feedback will be used to help improve the product
vi: Chúng tôi sẽ sử dụng phản hồi của bạn để giúp cải thiện sản phẩm
zh_hans: 你的反馈将用于改进产品

# l25
source: Thanks for your feedback!
vi: Cảm ơn bạn đã góp ý
zh_hans: 感谢你的反馈！

# l26
source: Tap to Translate
vi: Nhấn để dịch
zh_hans: 点按翻译

# l27
source: Tap on the Tap to Translate notification or the floating icon to translate from anywhere
vi: Nhấn vào thông báo Nhấn để dịch hoặc biểu tượng nổi để dịch ở bất cứ đâu
zh_hans: 点按 “点按翻译” 通知或悬浮图标，即可从任何位置进行翻译。

# l28
source: When on, Tap to Translate runs in the background and displays a notification
vi: Khi bật, tính năng Nhấn để dịch chạy ở chế độ nền và hiện một thông báo
zh_hans: “点按翻译” 功能开启后会在后台运行，并显示通知

# l29
source: Show floating icon
vi: Hiển thị biểu tượng nổi
zh_hans: 显示浮动图标

# l30
source: Floating icon stays on the screen for quick access to Tap to Translate
vi: Biểu tượng nổi luôn ở trên màn hình để truy cập nhanh vào tính năng Nhấn để dịch
zh_hans: 悬浮图标会停留在屏幕上，便于快速使用 “点按翻译” 功能

# l31
source: Auto-translate copied text
vi: Tự động dịch văn bản đã sao chép
zh_hans: 自动翻译复制的文字

# l32
source: When you tap on the floating icon, the copied text will automatically be translated
vi: Khi bạn nhấn vào biểu tượng nổi, hệ thống sẽ tự động dịch văn bản đã sao chép
zh_hans: 当你点按悬浮图标时，系统会自动翻译复制的文字

# l33
source: Useful
vi: Hữu ích
zh_hans: 赞

# l34
source: Useless
vi: Không hữu ích
zh_hans: 踩

# l35
source: Speak output
vi: Đọc bản dịch
zh_hans: 语音输出

# l36
source: Automatically speak translated text
vi: Tự động đọc văn bản đã dịch
zh_hans: 自动朗读译文

# l37
source: Block offensive words
vi: Chặn các từ phản cảm
zh_hans: 屏蔽不文明的字词

# l38
source: Hide recognized offensive speech results
vi: Ẩn lời nói phản cảm nhận dạng được
zh_hans: 隐藏确定为不文明的语音结果

# l39
source: Speech speed
vi: Tốc độ
zh_hans: 语速

# l40
source: {speed, select, normal{Normal} slow{Slow} slower{Slower} other{}}
vi: {speed, select, normal{Chuẩn} slow{Chậm} slower{Chậm hơn} other{}}
zh_hans: {speed, select, normal{正常} slow{慢} slower{较慢} other{}}

# l41
source: Text size
vi: Cỡ chữ
zh_hans: 文本大小

# l42
source: {size, select, large{Large} medium{Medium} small{Small} other{}}
vi: {size, select, large{Lớn} medium{Vừa} small{Nhỏ} other{}}
zh_hans: {size, select, large{大} medium{中} small{小} other{}}

# l43
source: Speech input
vi: Nhập liệu bằng lời nói
zh_hans: 语音输入

# l44
source: Speech voice
vi: Giọng nói
zh_hans: 语音

# l45
source: Are you sure to clear all saves?
vi: Xác nhận xóa tất cả phiên đã lưu?
zh_hans: 你确定清除所有保存记录？

# l46
source: Processing...
vi: Đang xử lý...
zh_hans: 正在处理···

# l47
source: {language, select, en{English} zh{Chinese} zh_Hans{Chinese (Simplified)} zh_Hant{Chinese (Traditional)} vi{Vietnamese} vi_Nom{Vietnamese (Sino-Nom)} other{}}
vi: {language, select, en{Tiếng Anh} zh{Tiếng Trung} zh_Hans{Tiếng Trung (Giản thể)} zh_Hant{Tiếng Trung (Phồn thể)} vi{Tiếng Việt} vi_Nom{Tiếng Việt (Hán Nôm)} other{}}
zh_hans: {language, select, en{英语} zh{中文} zh_Hans{中文 (简体)} zh_Hant{中文 (繁体)} vi{越南语} vi_Nom{越南语 (汉喃)} other{}}

# l48
source: An error occurred
vi: Đã có lỗi xảy ra
zh_hans: 已经出错了

# l49
source: Retry
vi: Thử lại
zh_hans: 重试

# l50
source: Translate from
vi: Dịch từ
zh_hans: 源语言

# l51
source: Text
vi: Văn bản
zh_hans: 文本

# l52
source: Image
vi: Hình ảnh
zh_hans: 图片

# l53
source: File
vi: Tài liệu
zh_hans: 文档

# l54
source: Website
vi: Trang web
zh_hans: 网页

# l55
source: Contribute
vi: Đóng góp
zh_hans: 贡献

# l56
source: Translation
vi: Bản dịch
zh_hans: 已译

# l57
source: The first of week
vi: Ngày đầu tuần
zh_hans: 每周起始日

# l58
source: {weekday, select, 1{Monday} 6{Saturday} 7{Sunday} other{}}
vi: {weekday, select, 1{Thứ hai} 6{Thứ bảy} 7{Chủ nhật} other{}}
zh_hans: {weekday, select, 1{星期一} 6{星期六} 7{星期日} other{}}

# l59
source: Show week number
vi: Hiển thị số tuần
zh_hans: 显示周数

# l60
source: {calendarView, select, schedule{Schedule} day{Day} week{Week} month{Month} other{}}
vi: {calendarView, select, schedule{Lịch biểu} day{Ngày} week{Tuần} month{Tháng} other{}}
zh_hans: {calendarView, select, schedule{历表} day{日} week{周} month{月} other{}}

# l61
source: {stem, select, 0{Jia} 1{Yi} 2{Bing} 3{Ding} 4{Mou} 5{Ji} 6{Geng} 7{Xin} 8{Ren} 9{Gui} other{}}
vi: {stem, select, 0{Giáp} 1{Ất} 2{Bính} 3{Đinh} 4{Mậu} 5{Kỷ} 6{Canh} 7{Tân} 8{Nhâm} 9{Quý} other{}}
zh_hans: {stem, select, 0{甲} 1{乙} 2{丙} 3{丁} 4{戊} 5{己} 6{庚} 7{辛} 8{壬} 9{癸} other{}}

# l62
source: {branch, select, 0{Zi} 1{Chou} 2{Yin} 3{Mao} 4{Chen} 5{Zi} 6{Wu} 7{Wei} 8{Shen} 9{You} 10{Xu} 11{Hai} other{}}
vi: {branch, select, 0{Tý} 1{Sửu} 2{Dần} 3{Mão} 4{Thìn} 5{Tỵ} 6{Ngọ} 7{Mùi} 8{Thân} 9{Dậu} 10{Tuất} 11{Hợi} other{}}
zh_hans: {branch, select, 0{子} 1{丑} 2{寅} 3{卯} 4{辰} 5{巳} 6{午} 7{未} 8{申} 9{酉} 10{戌} 11{亥} other{}}

# l63
source: Specimen
vi: Bản mẫu
zh_hans: 样本

# l64
source: Tester
vi: Kiểm nhập
zh_hans: 测试

# l65
source: Glyphs
vi: Ký tự
zh_hans: 字形

# l66
source: Information
vi: Thông tin
zh_hans: 信息

# l67
source: {fontFamily, select, nomnatong{Nom Na Tong} hannomgothic{Han Nom Gothic} hannomkhai{Han Nom Khai} hannomminh{Han Nom Minh} misansl3{MiSans L3} other{}}
vi: {fontFamily, select, nomnatong{Nôm Na Tống} hannomgothic{Hán Nôm Gothic} hannomkhai{Hán Nôm Khải} hannomminh{Hán Nôm Minh} misansl3{MiSans L3} other{}}
zh_hans: {fontFamily, select, nomnatong{喃那宋} hannomgothic{汉喃哥特} hannomkhai{汉喃楷} hannomminh{汉喃明} misansl3{MiSans L3} other{}}

# l68
source: Weight {fontWeight} at size {fontSize}px
vi: Độ đậm {fontWeight} với kích thước {fontSize}px
zh_hans: 粗细 {fontWeight} 大小为 {fontSize}px

# l69
source: Italic
vi: In nghiêng
zh_hans: 斜体

# l70
source: Only a subset of all the glyphs are shown here. Download the font to view the full set or try it out in the |.
vi: Chỉ có một số chữ được hiển thị tại đây. Tải xuống phông chữ để xem toàn bộ các chữ hoặc thử chúng trong phần |.
zh_hans: 此处仅显示部分文本。 下载字体以查看所有文本或在|中尝试。

# l71
source: Are you sure to delete selected font?
vi: Xác nhận xóa phông chữ đã chọn?
zh_hans: 确认删除所选字体吗？

# l72
source: Delete {object}
vi: Xóa {object}
zh_hans: 删除{object}

# l73
source: Default
vi: Mặc định
zh_hans: 預設

# l74
source: Custom
vi: Tùy chọn
zh_hans: 自選

# l75
source: If this is your first time using the app, please check your network connection and try again later.
vi: Nếu đây là lần đầu tiên sử dụng ứng dụng, vui lòng kiểm tra lại kết nối mạng và thử lại sau.
zh_hans: 如果这是您第一次使用该应用程序，请检查您的网络连接并稍后重试。

# l76
source: Select
vi: Chọn
zh_hans: 选择

# l77
source: Select all
vi: Chọn tất cả
zh_hans: 全选

# l78
source: Cut
vi: Cắt
zh_hans: 剪切

# l79
source: Copy
vi: Sao chép
zh_hans: 复制

# l80
source: Suggest a translation
vi: Đề xuất bản dịch
zh_hans: 建议的翻译

# l81
source: Open in Nomna {object, select, translate{Translate} other{}}
vi: Mở trong Nomna {object, select, translate{Phiên dịch} other{}}
zh_hans: 在喃那{object, select, translate{翻译} other{}}中打开

# l82
source: We''ll use your contributions to improve translation quality and may show them to other users (without identifying you).
vi: Chúng tôi sẽ sử dụng nội dung bạn đóng góp để cải thiện chất lượng bản dịch và có thể cho người dùng khác xem các nội dung này (mà không xác định danh tính của bạn).
zh_hans: 我们将使用您贡献的内容来提高翻译质量，并可能使这些内容对其他用户可见（不会识别您的身份）。

# l83
source: Share the Nomna Contribute app with your friends so they can start contributing too.
vi: Chia sẻ ứng dụng Nomna Đóng góp với bạn bè để họ cũng có thể bắt đầu tham gia đóng góp.
zh_hans: 与您的朋友分享喃那贡献应用程序，以便他们也可以开始贡献。

# l84
source: Share with friends
vi: Chia sẻ với bạn bè
zh_hans: 与朋友分享

# l85
source: Home
vi: Trang chủ
zh_hans: 家

# l86
source: Contribution conditions
vi: Điều kiện đóng góp
zh_hans: 贡献条件

# l87
source: Selection
vi: Đã chọn
zh_hans: 已选

# l88
source: Font weight
vi: Độ đậm
zh_hans: 字重

# l89
source: Font style
vi: Kiểu chữ
zh_hans: 字体样式

# l90
source: Normal
vi: Bình thường
zh_hans: 正常

# l91
source: Draw
vi: Vẽ màu
zh_hans: 画画

# l92
source: Navigate
vi: Thao tác
zh_hans: 导航

# l93
source: Send feedback
vi: Gửi phản hồi
zh_hans: 发送回馈

# l94
source: Describe your feedback
vi: Mô tả ý kiến phản hồi của bạn
zh_hans: 描述您的回馈

# l95
source: Full screen
vi: Toàn màn hình
zh_hans: 全屏

# l96
source: Translation added to saved list
vi: Đã thêm bản dịch vào danh sách đã lưu
zh_hans: 翻译已添加到已保存列表

# l97
source: Translation removed from saved list
vi: Đã xóa bản dịch khỏi danh sách đã lưu
zh_hans: 翻译已从保存列表中删除

# l98
source: {model, select, ua{Daily conversion help} ub{Use advanced collection} uc{Ideal for in-depth research} other{}}
vi: {model, select, ua{Trợ giúp chuyển đổi hàng ngày} ub{Sử dụng quá trình thu thập nâng cao} uc{Lý tưởng cho các nghiên cứu chuyên sâu} other{}}
zh_hans: {model, select, ua{每日转换帮助} ub{使用高级集合} uc{适合深入研究} other{}}
